---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PointClouds.IPointSetIterator
source: html/7c4c6214-7b2e-6f99-0621-25321a9cd70f.htm
---
# IPointSetIterator Members

Use this method to discard any resources consumed by the iterator. Revit will call it when done using the iterator.